
## Plan Result (static.cube-unit.net)

[CI link](https://github.com/shimosyan/cube-unit.net/actions/runs/16727971932)


<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * aws_s3_bucket_server_side_encryption_configuration.main
  * aws_s3_bucket_versioning.main
* Update
  * aws_cloudfront_distribution.s3_distribution
  * aws_s3_bucket_policy.policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.policy_document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::static.cube-unit.net",
              + "arn:aws:s3:::static.cube-unit.net/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::158677943024:distribution/EVP5RFBESZVQY",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "EVP5RFBESZVQY"
        tags                            = {}
        # (24 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (16 unchanged attributes hidden)

          - function_association {
              - event_type   = "viewer-request" -> null
              - function_arn = "arn:aws:cloudfront::158677943024:function/cloudfront-s3-redirect" -> null
            }
          + function_association {
              + event_type   = "viewer-request"
              + function_arn = "arn:aws:cloudfront::158677943024:function/static-cube-unit-net-asset-redirect"
            }

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "policy" {
        id     = "static.cube-unit.net"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceArn" = "arn:aws:cloudfront::158677943024:distribution/EVP5RFBESZVQY"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::static.cube-unit.net/*",
                          - "arn:aws:s3:::static.cube-unit.net",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.main will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      + bucket = "static.cube-unit.net"
      + id     = (known after apply)
      + region = "ap-northeast-1"

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.main will be created
  + resource "aws_s3_bucket_versioning" "main" {
      + bucket = "static.cube-unit.net"
      + id     = (known after apply)
      + region = "ap-northeast-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":55,"Program":"tfcmt","SHA1":"6bab127d30d39f98d59dbb10cd1829808bdafa57","Target":"static.cube-unit.net","Vars":{},"WorkflowName":"terraform-pull-request"} -->